app/Participante.php

    public static function createParticipanteImport($data)
    {
        $test = DB::table('tests')->where('nombre', $data['test'] )->first();
---
select * from `tests` where `nombre` = 'Prueba programacion 1' limit 1