app/Pregunta.php

    public static function obtenerCantidadPreguntasDificultad($asignaturas_id,$dificultad,$cantidad){
        $preguntas = Pregunta::whereIn('asignatura_id',$asignaturas_id)
        ->where("dificultad","=",$dificultad)
        ->inRandomOrder()
        ->limit($cantidad)
        ->get();
---
select * from `preguntas` where `asignatura_id` in (1, 2) and `dificultad` = 1 and `preguntas`.`deleted_at` is null order by RAND() limit 4

    public static function respuestaCorrecta($pregunta_id,$respuesta_id){
        $resp=true;
        $respuesta = Respuesta::where('pregunta_id',$pregunta_id)
        ->where("id","=",$respuesta_id)
        ->where("correcta","=",1)
        ->get();
---
select * from `respuestas` where `pregunta_id` = '96' and `id` = '381' and `correcta` = 1 and `respuestas`.`deleted_at` is null

    public static function createPreguntaImport($data)
    {

        $asignatura = DB::table('asignaturas')->where('nombre', $data['materia'] )->first();
---
select * from `asignaturas` where `nombre` = 'Programacion 1' limit 1