app/RegistroJuego.php

select `respuestas`.`correcta` from `registro_juego` inner join `respuestas` on `respuestas`.`id` = `registro_juego`.`respuesta_id` where (`registro_juego`.`estado` = 1 and `registro_juego`.`participante_id` = 3)
---
    public static function contadorRespuestas($participante_id)
    {
        //$resultado=consultar_datos_db($conexion,"correcta","respuestas b, registro_juego a","a.estado=1 and a.respuesta_id=b.id and a.participante_id=".$_REQUEST['id']);
        $correctas = 0;

        $respuestas = DB::table('registro_juego')
            ->join('respuestas', 'respuestas.id', '=', 'registro_juego.respuesta_id')
            ->select('respuestas.correcta')
            ->where([
                ['registro_juego.estado','=',1],
                ['registro_juego.participante_id','=',$participante_id]
                ])
            ->get();