app/Http/Controllers/AdminController.php

    public function index()
    {
        $usuarios = User::all();
---
select * from `users` where `users`.`deleted_at` is null