app/Http/Controllers/AsignaturaController.php

    public function index()
    {
        $asignaturas = Asignatura::all();
---
select * from `asignaturas` where `asignaturas`.`deleted_at` is null