app/Http/Controllers/juegoController.php

select * from `participantes` where `participantes`.`deleted_at` is null limit 10 offset 0
select * from `tests` where `tests`.`id` in (1) and `tests`.`deleted_at` is null
select count(*) as aggregate from `participantes` where `participantes`.`deleted_at` is null
---
    public function index()
    {
        $participantes = Participante::with('test')->paginate(10);

select `asignaturas`.*, `asignatura_test`.`test_id` as `pivot_test_id`, `asignatura_test`.`asignatura_id` as `pivot_asignatura_id` from `asignaturas` inner join `asignatura_test` on `asignaturas`.`id` = `asignatura_test`.`asignatura_id` where `asignatura_test`.`test_id` = 1 and `asignaturas`.`deleted_at` is null
---
    public function start(Participante $participante)
    {
        $fondo_juego = Configuracion::where("nombre","=","fondo_modo_juego")->first();
        $test = Test::find($participante->test_id);

        $asignaturas_id = $test->asignaturas->pluck('id');

select * from `registro_juego` where `participante_id` = 2 and `respuesta_id` is null and `estado` = '1' and `registro_juego`.`deleted_at` is null order by `orden` asc
---
    public function preguntasJuego(Participante $participante){
        $fondo_juego = Configuracion::where("nombre","=","fondo_modo_juego")->first();
        $registro_juego = RegistroJuego::where('participante_id','=',$participante->id)
                        ->whereNull("respuesta_id")
                        ->where("estado","=","1")
                        ->orderBy('orden','asc')->get();

update `registro_juego` set `estado` = 0, `registro_juego`.`updated_at` = '2020-02-24 21:27:27' where `participante_id` = 1 and `registro_juego`.`deleted_at` is null
---
    public function reiniciarJuego(Participante $participante){

        $campos_registro_juego = ([
            'estado' => 0
        ]);
        RegistroJuego::where('participante_id',$participante->id)->update($campos_registro_juego);

update `registro_juego` set `respuesta_id` = '503', `registro_juego`.`updated_at` = '2019-10-16 20:32:22' where `participante_id` = '2' and `pregunta_id` = '126' and `registro_juego`.`deleted_at` is null
select * from `registro_juego` where `participante_id` = '2' and `respuesta_id` is null and `estado` = '1' and `registro_juego`.`deleted_at` is null order by `orden` asc
---
    public function verificarRespuesta(Request $request){
        $esCorrecta = Pregunta::respuestaCorrecta($request->idpregunta,$request->tipo);
        $response["correcta"] = $esCorrecta;
        $response["jugador"]=$request->id;

        //Registra la respuesta
        $campos_registro_juego = ([
            'respuesta_id' => $request->tipo
        ]);
        RegistroJuego::where('participante_id',$request->id)
                    ->where('pregunta_id','=',$request->idpregunta)
                    ->update($campos_registro_juego);

        //Valida si la respuesta es correcta
        if($esCorrecta){
            $response["correcta"] = $esCorrecta;
            $response["puntaje"]='<img width="25px" height="25px" src="imagenes/check.png">';
            $response["consecutivo"]=$request->consecutivo +1;
	        $response["etiqueta_consecutivo"]="puntaje_".$request->consecutivo;
            $registro_juego = RegistroJuego::where('participante_id','=',$request->id)
                        ->whereNull("respuesta_id")
                        ->where("estado","=","1")
                        ->orderBy('orden','asc')->get();

select * from `respuestas` where `respuestas`.`pregunta_id` = 3 and `respuestas`.`pregunta_id` is not null and `respuestas`.`deleted_at` is null order by RAND()
---
                $response["fin"]=true;
            }else{
                $pregunta = Pregunta::find($registro_juego[0]->pregunta_id);
                $respuestas = Pregunta::find($registro_juego[0]->pregunta_id)->respuestas()->get();

select * from `respuestas` where `pregunta_id` = '11' and `correcta` = 0 and `respuestas`.`deleted_at` is null order by RAND() limit 2
---
    public function ayudarRespuesta(Request $request){
        $respuestas = Respuesta::where('pregunta_id',$request->idpregunta)
        ->where("correcta","=",0)
        ->inRandomOrder()
        ->limit(2)
        ->get();

select * from `tests` where `tests`.`id` = 1 and `tests`.`deleted_at` is null
update `participantes` set `estado` = 0, `participantes`.`updated_at` = '2019-10-16 20:53:59' where `id` = 2 and `participantes`.`deleted_at` is null
update `registro_juego` set `estado` = 0, `registro_juego`.`updated_at` = '2019-10-16 21:11:28' where `participante_id` = 3 and `registro_juego`.`deleted_at` is null
update `participantes` set `deleted_at` = '2019-10-16 21:11:28', `participantes`.`updated_at` = '2019-10-16 21:11:28' where `id` = 3
update `registro_juego` set `deleted_at` = '2019-10-16 21:11:28', `registro_juego`.`updated_at` = '2019-10-16 21:11:28' where `participante_id` = 3 and `registro_juego`.`deleted_at` is null
---
    public function resumen(Participante $participante){

        $fondo_juego = Configuracion::where("nombre","=","fondo_modo_juego")->first();
        $test = $participante->test()->get();
        $respuestas = RegistroJuego::contadorRespuestas($participante->id);

        $datos_jugador['nombres'] = ucwords(strtolower($participante->nombres));
        $datos_jugador['preguntas_total'] = $test[0]->preguntas_total;
        $datos_jugador['correctas'] = $respuestas;

       $registro=RegistroJuego::where('participante_id','=',$participante->id);

       $registro->update((['estado' => 0]));
       $registro->delete();