app/Http/Controllers/ParticipanteController.php

    public function index()
    {
        $participantes = Participante::all();
---
select * from `participantes` where `participantes`.`deleted_at` is null

    public function edit(Participante $participante)
    {
        $tests = Test::orderBy('nombre', 'ASC')->get();
---
select * from `tests` where `tests`.`deleted_at` is null order by `nombre` asc

    public function update(Request $request, Participante $participante)
    {
        $data = request()->validate([
            'nombres' => 'required',
            'identificacion' => 'required',
            'universidad' => 'required',
            'opc1' => 'required',
            'opc2' => 'required',
            'test_id' => 'required',
        ],
            [
                'nombres.required' => 'El campo nombre es obligatorio',
                'identificacion.required' => 'El campo identificacion es obligatorio',
                'universidad.required' => 'El campo universidad es obligatorio',
                'opc1.required' => 'La opcion 1 es obligatoria',
                'opc2.required' => 'La opcion 2 es obligatoria',
                'test_id.required' => 'El test es obligatorio'
            ]);
        $campos_participante = ([
            'nombres' => $data['nombres'],
            'identificacion' => $data['identificacion'],
            'universidad' => $data['universidad'],
            'opc1' => $data['opc1'],
            'opc2' => $data['opc2'],
            'test_id' => $data['test_id'],
        ]);
        $participante->update($campos_participante);
---
update `participantes` set `deleted_at` = '2019-10-23 14:39:16', `participantes`.`updated_at` = '2019-10-23 14:39:16' where `id` = 5