app/Http/Controllers/PreguntaController.php

select * from `preguntas` where `preguntas`.`deleted_at` is null
---
    public function index()
    {
        $preguntas = Pregunta::all();

select * from `asignaturas` where `asignaturas`.`deleted_at` is null order by `nombre` asc
---
    public function create()
    {
        $asignaturas = Asignatura::orderBy('nombre', 'ASC')->get();

select * from `asignaturas` where `asignaturas`.`deleted_at` is null order by `nombre` asc
---
    public function edit(Pregunta $pregunta)
    {
        $asignaturas = Asignatura::orderBy('nombre', 'ASC')->get();