app/Http/Controllers/TestController.php

select * from `tests` where `tests`.`deleted_at` is null
---
    public function index()
    {
        $tests = Test::all();

select * from `asignaturas` where `asignaturas`.`deleted_at` is null order by `nombre` asc
---
    public function edit(Test $test)
    {
        $asignaturas = Asignatura::orderBy('nombre', 'ASC')->get();